cf/Documents/УстановкаЦенНоменклатурыКонкурентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаЦенНоменклатурыКонкурентов</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныНоменклатурыКонкурентов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/УстановкаЦенНоменклатурыКонкурентов/Forms/ИзменениеЦенНаПроцент/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТипЦенОснование.СписокВыбора.ЗагрузитьЗначения(Параметры.ТипыЦен.ВыгрузитьЗначения());
	
	Для Каждого Строка из Параметры.ТипыЦен Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.ТипЦен 				= Строка.Значение;
		НоваяСтрока.ТипЦенОснование 	= НоваяСтрока.ТипЦен;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры
&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	//Адрес = ПоместитьВоВременноеХранилище(ВладелецФормы.ТаблицаТоваров, ВладелецФормы.УникальныйИдентификатор);
	//ВладелецФормы.ДействиеОтменено = Ложь;
	
	ВладелецФормы.УстановитьВозможностьОтменыДействия();

	СоответствиеИмен = ВладелецФормы.ПолучитьСоответствияТиповЦен();

	// какая-то пошаговая фигня
	
	Для Каждого СтрокаПроцент Из Таблица Цикл
		Если СтрокаПроцент.Пометка И СтрокаПроцент.Процент <> 0 Тогда
			
			//частный случай для увеличения цены на процент по отношению к себестоимости
				ИмяКолонки = СоответствиеИмен[СтрокаПроцент.ТипЦен];
				ИмяКолонкиОснование = СоответствиеИмен[СтрокаПроцент.ТипЦенОснование];
				ИмяКолонкиЦеныОснование = "Цена" + ИмяКолонкиОснование;
				
			   	Для Каждого Строка Из ВладелецФормы.ТаблицаТоваров Цикл
					Если ЗначениеЗаполнено(Строка[ИмяКолонкиЦеныОснование]) Тогда
						
							// величину колонки основания приводим к типу изменяемой колонки
							ВеличинаОснования =	 Число(ВладелецФормы.ЦенаВВыбраннойВалюте(Строка["Цена" + ИмяКолонкиОснование], Строка["Валюта" + ИмяКолонкиОснование], Строка["Валюта" + ИмяКолонки]));					
							Слагаемое = ВеличинаОснования*(СтрокаПроцент.Процент/100);
							
							Строка["СтараяЦен" + ИмяКолонки] = Строка["Цена" + ИмяКолонки];
							Строка["Цена" + ИмяКолонки] = Формат(ВеличинаОснования + Слагаемое, "ЧЦ=10; ЧДЦ=2");
							
							//ВладелецФормы.ЦеныПересчеты(Строка.ПолучитьИдентификатор(), ИмяКолонки);
						
					КонецЕсли;		
				КонецЦикла;
				
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентПриИзменении(Элемент)
	Если Элементы.Таблица.ТекущиеДанные <> Неопределено Тогда
		Элементы.Таблица.ТекущиеДанные.Пометка = Истина;
	КонецЕсли;
КонецПроцедуры
